# StructuralConnectionNotEnoughRefs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionNotEnoughRefs Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Structural Connection Handler cannot connect fewer than two elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionNotEnoughRefs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionNotEnoughRefs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionNotEnoughRefs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace